[{"creek_name":"Wildcat Creek","creek_description":"Wildcat Creek runs from East Bay Regional Park District land (Wildcat Canyon and Alvarado Park) down through the Cities of Richmond and San Pablo, ending in the San Francisco Bay. 90% of its 13 miles are natural, with no obvious reinforcements or concrete channel. \n\nMost of its watershed (the land that drains to the creek) is parkland, with only 20% covered by impervious surfaces such as roads and houses.","creek_id":"WIL","creek_lat":37.957,"creek_long":-122.3425,"sites":[{"site_id":"WIL070","name":"Wildcat Creek at Alvarado Park","label":"Alvarado Park","description":"Wildcat Creek is piped under the Alvarado Staging Area before coming out into an open pool area which is used by kids and dogs, and supports a healthy newt population. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. It is the farthest upstream on Wildcat Creek that we monitor, and the bottom of the creek is dominated by large rocks. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9521,"long":-122.3198},{"site_id":"WIL060","name":"Wildcat Creek at Vale Rd.","label":"Vale Rd.","description":"Wildcat Creek passes under Vale Road in a concrete channel, and once a month we monitor on the downstream side for temperature, dissolved oxygen, conductivity, pH, and turbidity. Rocks and cobbles from upstream have been deposited on the bottom of the channel, which also supports a healthy amount of graffiti. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9532,"long":-122.3386},{"site_id":"WIL050","name":"Wildcat Creek at Davis Park","label":"Davis Park","description":"Wildcat Creek passes along the north side of the John Herbert Davis Park and underneath a foot bridge. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. In 2018 we also monitored the site for benthic macroinvertebrates. The sides of the channel here are dominated by dense foliage including vines, bushes, and trees. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.962,"long":-122.3509},{"site_id":"WIL040","name":"Wildcat Creek at Verde Elementary","label":"Verde Elementary","description":"Wildcat Creek passes underneath Giaramita Street, right in front of Verde Elementary School. The Wildcat Creek Trail runs alongside the creek in a large, open area. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. The creek bed is mostly mud and, depending on the time of year, there will be tall grass along the north side of the creek or none at all. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9607,"long":-122.3637}]},{"creek_name":"San Pablo Creek","creek_description":"San Pablo Creek runs from the City of Orinda, through East Bay Municipal Utility District lands, the Cities of Richmond and San Pablo and the community of El Sobrante, before it enters the saltwater marshes adjacent to the San Francisco Bay. 90% of its 20 miles are natural, with no obvious reinforcements or concrete channel. Much of its watershed (the land that drains to the creek) is parkland, with only 20% covered by impervious surfaces such as roads and houses.","creek_id":"SPA","creek_lat":37.9238,"creek_long":-122.2389,"sites":[{"site_id":"SPA129","name":"San Pablo Creek at Castro Creek Tributary","label":"Castro Creek Tributary","description":"Castro Creek comes out of the east side of a large, concrete culvert nestled between some houses. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. The creek flows between two concrete walls before flowing onward into a more natural area. Newts can be spotted here during certain times of the year. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9556,"long":-122.2702},{"site_id":"SPA110","name":"San Pablo Creek at Wilkie Creek Tributary","label":"Wilkie Creek Tributary","description":"Willkie Creek runs through a small park right outside De Anza High School before flowing into two pipes underneath Santa Rita Road. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We also occasionally monitor the site for benthic macroinvertebrates. The creek in this area is dominated by a few large rocks as well as concrete cast to look like sandbags. Grass grows all around this area. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9689,"long":-122.2905},{"site_id":"SPA108","name":"San Pablo Creek at Appian Creek Tributary","label":"Appian Creek Tributary","description":"Appian Creek runs alongside a parking lot and basketball court behind The Boy’s and Girl’s Club on Appian Way. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We also occasionally monitor the site for benthic macroinvertebrates. The south eastern bank of the creek is dominated by dense foliage and tall trees as well as trash. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9725,"long":-122.3021},{"site_id":"SPA103","name":"San Pablo Creek at El Sobrante Library","label":"El Sobrante Library","description":"San Pablo Creek runs through a dense forest area 75 meters past a gate behind the El Sobrante Library. It is very common to see turkeys and deer in this area, particularly along the creek itself. The creek bed is mostly mud, sand, and gravel. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We also occasionally monitor the site for benthic macroinvertebrates. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9667,"long":-122.3102},{"site_id":"SPA260","name":"San Pablo Creek at Orchard Rd.","label":"Orchard Rd.","description":"San Pablo Creek is piped underneath Orchard Road before coming out into a snug forested area and flowing northwest. The monitoring site is at the bottom of a large, medium-sized boulder pile leading down from the road. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.864,"long":-122.1677},{"site_id":"SPA250","name":"San Pablo Creek at Brookside Rd.","label":"Brookside Rd.","description":"San Pablo Creek runs along the southern side of the McDonnell Nursery off of Brookside Road. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. The site is dominated by small rocks and foliage. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.8656,"long":-122.1741},{"site_id":"SPA230","name":"San Pablo Creek at Caldecott Creek Tributary","label":"Caldecott Creek Tributary","description":"Caldecott Creek runs directly into San Pablo Creek at this junction located behind the Atma Yoga studio parking area. The creek is lined by medium rocks and large roots belonging to trees. It flows into a large pool which is part of San Pablo Creek.  This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.8772,"long":-122.1821},{"site_id":"SPA231","name":"San Pablo Creek at Brookwood Rd.","label":"Brookwood Rd.","description":"San Pablo Creek runs out of a large effluent tube underneath the Brookside Road Intersection. It flows into large pool which the Caldecott Creek Tributary also flows into. The water in the pool is very murky and deep.  This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.8791,"long":-122.1812},{"site_id":"SPA210","name":"San Pablo Creek at Lauterwasser Creek Tributary","label":"Lauterwasser Creek Tributary","description":"Lauterwasser Creek runs out from underneath Lombardy Lane and into a small pool carved out from large rocks. The area is populated by lots of foliage including poison oak. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9042,"long":-122.1894},{"site_id":"SPA180","name":"San Pablo Creek at Manzanita Bridge","label":"Manzanita Bridge","description":"San Pablo Creek passes under the Manzanita Bridge in a wide channel filled with pebbles and small rocks with large piles of boulders on either side. Small fish species are often seen here. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.8939,"long":-122.2024}]},{"creek_name":"Alhambra Creek","creek_description":"Alhambra Creek runs from Briones Regional Park through the City of Martinez and out to the Carquinez Strait. 86% of its 8 miles are natural, with no obvious reinforcements or concrete channel. Over 40% of its watershed (the land that drains to the creek) is agricultural land, while 15% is covered by impervious surfaces such as roads and houses.","creek_id":"ALH","creek_lat":38.0008,"creek_long":-122.1297,"sites":[{"site_id":"ALH110","name":"Alhambra Creek at F St.","label":"F St.","description":"Alhambra Creek passes beneath a large footbridge located at the end of F Street. It flows down channel with steep sides populated with lots of foliage including large trees. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":38.0008,"long":-122.1297}]},{"creek_name":"Walnut Creek","creek_description":"Walnut Creek runs from Mount Diablo and the East Bay Hills through the Cities of  Walnut Creek, Pleasant Hill, Lafayette, and Danville before reaching the Carquinez Strait. 70% if its 29 miles are natural, with no obvious reinforcements or concrete channel. 45% of its watershed (the land that drains to the creek) is residential, while 30% is covered by impervious surfaces such as roads and houses. This large watershed encompasses over 90,000 acres and contains many smaller creeks that enter the main stem of Walnut Creek, including Grayson Creek.","creek_id":"WAL","creek_lat":37.9397,"creek_long":-122.0592,"sites":[{"site_id":"WAL080","name":"Walnut Creek at Civic Park","label":"Civic Park","description":"Walnut Creek runs through Civic Park just northeast of the main park entrance. It is located right off the creek trail. The area has lots of trees and grasses. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9051,"long":-122.0578},{"site_id":"CEO170","name":"Grayson Creek at Pleasant Hill Middle School","label":"Pleasant Hill Middle School","description":"Grayson Creek flows behind Pleasant Hill Middle School right below an embankment next to the service road. The area is populated by grasses and a large shipping container. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9361,"long":-122.065},{"site_id":"WAL045","name":"Walnut Creek at Highway-242","label":"Highway-242","description":"Walnut Creek flows beneath SR-242 into a large open area between SR-242 and I-680. This area is right below a large, sloped, concrete embankment and past a fence. The banks of the creek are lined with large bushes and tall grass and the creek bed is covered in pebbles. Fish live here. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9609,"long":-122.0522},{"site_id":"CEO166","name":"Grayson Creek at Golf Club Rd.","label":"Golf Club Rd.","description":"Grayson Creek passes under Golf Club Road and into a large, open channel next to the El Tapatio Mexican restaurant and across from Chilpancingo Park. The banks of the creek can be covered in tall plants unless they have been removed. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. Fish and waterfowl are often seen here. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.972,"long":-122.0662},{"site_id":"CEO160","name":"Grayson Creek at Chilpancingo Pkwy.","label":"Chilpancingo Pkwy.","description":"Grayson Creek flows north continuing along a wide, open channel before flowing under Chilpancingo Parkway. The areas has some tall grass right next to the creek and animals such as fish, waterfowl and even turtles can be found here. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9751,"long":-122.0658},{"site_id":"CEO168","name":"Grayson Creek at Diablo Valley College","label":"Diablo Valley College","description":"Grayson Creek flows through the eastern part of Diablo Valley College before going under Golf Club Road. The banks are somewhat steep and covered in grass, and the dominant substrate is mainly mud. This site is monitored once or twice a year for temperature, dissolved oxygen, conductivity, pH, and turbidity, in collaboration with environmental science classes at the college. We always take volunteers on our monitoring expeditions, where you'll learn about the equipment we use and do observational assessments.","lat":37.9709,"long":-122.067}]},{"creek_name":"Marsh Creek","creek_description":"Marsh Creek runs from the Mount Diablo foothills through the Cities of Brentwood and Oakley before entering the San Joaquin River Delta. 94% of its 35 miles are natural, with no obvious reinforcements or concrete channel. Over 40% of its watershed (the land that drains to the creek) is made up of agricultural lands, and many creek alterations have taken place over the years to dam the creek or use it to irrigate crops. While only 15% of the watershed is covered by impervious surfaces such as roads and houses, significant residential development is planned for the coming years.","creek_id":"MSH","creek_lat":37.9319,"creek_long":-121.7559,"sites":[{"site_id":"MSH120","name":"Marsh Creek at Aspara Dr.","label":"Aspara Dr.","description":"Marsh Creek flows through a concrete culvert and into a small park with a gazebo in it. The creek bed is mostly mud and there is lots of foliage in the area. This site is monitored once a month for temperature, dissolved oxygen, conductivity, and pH. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.8927,"long":-121.8546},{"site_id":"MSH110","name":"Marsh Creek at 2103 Marsh Creek Rd.","label":"2103 Marsh Creek Rd.","description":"Marsh Creek passes right under the Marsh Creek Road Overpass. The banks of the creek are lined with plants including poison oak. The creek bed often has small rocks and cobble in it. This site is monitored once a month for temperature, dissolved oxygen, conductivity, and pH. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.8904,"long":-121.849},{"site_id":"MSH100","name":"Marsh Creek at 14350 Marsh Creek Rd.","label":"14350 Marsh Creek Rd.","description":"Marsh Creek flows underneath a large, log footbridge located west of a fire gate in a densely wooded area. The creek bed is mostly gravel. This site is monitored once a month for temperature, dissolved oxygen, conductivity, and pH. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.8841,"long":-121.825},{"site_id":"MSH090","name":"Marsh Creek at 16000 Marsh Creek Rd.","label":"16000 Marsh Creek Rd.","description":"Marsh Creek flows just south of Marsh Creek Road on the left of a grassy turnout near a house at the end of a long driveway. The area is populated by lots of foliage and the creek bed is mostly gravel. This site is monitored once a month for temperature, dissolved oxygen, conductivity, and pH. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.8904,"long":-121.8027},{"site_id":"MSH061","name":"Marsh Creek at Creekside Park","label":"Creekside Park","description":"Marsh Creek flows through Creekside Park and into a storm culvert outfall under a footbridge. This site is currently inactive.","lat":37.9231,"long":-121.7121},{"site_id":"MSH050","name":"Marsh Creek at Deer Creek","label":"Deer Creek","description":"Marsh Creek flows just north of Central Boulevard just along the west side of the Marsh Creek Trail. The banks of the creek are mostly concrete riprap. This site is currently inactive.","lat":37.9386,"long":-121.7069},{"site_id":"MSH045","name":"Marsh Creek at Sand Creek","label":"Sand Creek","description":"Marsh Creek flows alongside Island Palm Way just south of Monarch Park. The banks of the creek are mostly concrete riprap. This site is currently inactive.","lat":37.9381,"long":-121.7071},{"site_id":"MSH030","name":"Marsh Creek at Delta Rd.","label":"Delta Rd.","description":"Marsh Creek flows underneath the Delta Road Overpass right next to a dirt parking lot. This site is currently inactive.","lat":37.9685,"long":-121.6828},{"site_id":"MSH020","name":"Marsh Creek at Cypress Rd.","label":"Cypress Rd.","description":"Marsh Creek runs under the old railroad overpass, near the Marsh Creek trail parking lot right off of Cypress Drive (off of E. Cypress Road). This site is currently inactive.","lat":37.9911,"long":-121.6963}]},{"creek_name":"Baxter Creek","creek_description":"Baxter Creek is one of several creeks originating in an underground spring beneath El Cerrito’s Mira Vista Golf Course. It runs through the Cities of El Cerrito and Richmond before entering into the San Francisco Bay at Stege Marsh. 41% of its 3 miles are natural, with no obvious reinforcements or concrete channel. Close to 60% of its watershed (the land that drains to the creek) is residential, while 65% is covered by impervious surfaces such as roads and houses.","creek_id":"BAX","creek_lat":37.9192,"creek_long":-122.3262,"sites":[{"site_id":"BAX030","name":"Bioswale on Baxter Creek at Booker T. Anderson Community Center","label":"Booker T. Anderson Community Center","description":"A bioswale constructed in 2018 now filters stormwater from the Community Center parking lot through native plants and layers of soil before discharging to Rheem Creek.","lat":37.9192,"long":-122.3262}]},{"creek_name":"Rheem Creek","creek_description":"Rheem Creek runs from the City of Richmond (just East of Highway 80) through the Cities of Pinole and San Pablo before entering the San Francisco Bay south of Point Pinole. One third of its 3 miles are culverted under residential areas, while the remainder of the creek is above ground but contained in concrete and earthen channels. 50% of its watershed (the land that drains to the creek) is covered by impervious surfaces such as roads and houses.","creek_id":"SUP","creek_lat":37.9723,"creek_long":-122.3435,"sites":[{"site_id":"SUP030","name":"Rheem Creek at Wanlass Park","label":"Wanlass Park","description":"Rheem Creek flows underneath a small bridge leading into Wanlass Park. The banks of the creek are populated by dense foliage including lots of tall grass and, occasionally, cattails. Both area surrounding the creek and the creek itself are usually filled with trash and the water smells like sewage. This site is monitored once a month for temperature, dissolved oxygen, conductivity, pH, and turbidity. We always take volunteers on our monitoring expeditions, where you’ll learn about the equipment we use and do observational assessments.","lat":37.9723,"long":-122.3435}]}]